lyusupov/SoftRF/software/firmware/source/SkyView/Platform_RP2040.cpp
#if defined(ARDUINO_RASPBERRY_PI_PICO)
  RP2040_board     = RP2040_RPIPICO;
  hw_info.revision = HW_REV_PICO;
#elif defined(ARDUINO_RASPBERRY_PI_PICO_W)
  RP2040_board     = rp2040.isPicoW() ? RP2040_RPIPICO_W : RP2040_RPIPICO;
  hw_info.revision = rp2040.isPicoW() ? HW_REV_PICO_W    : HW_REV_PICO;
#endif /* ARDUINO_RASPBERRY_PI_PICO */

  RP2040_board = (SoC->getChipId() == 0xcf516424) ?
                  RP2040_WEACT : RP2040_board;

#if !defined(ARDUINO_ARCH_MBED)
  RP2040_has_spiflash = SPIFlash->begin(possible_devices,
                                        EXTERNAL_FLASH_DEVICE_COUNT);
  if (RP2040_has_spiflash) {
    spiflash_id = SPIFlash->getJEDECID();

    uint32_t capacity = spiflash_id & 0xFF;
    if (capacity >= 0x15) { /* equal or greater than 1UL << 21 (2 MiB) */

#if defined(USE_TINYUSB)
      // Set disk vendor id, product id and revision
      // with string up to 8, 16, 4 characters respectively
      usb_msc.setID(RP2040_Device_Manufacturer, "Internal Flash", "1.0");

      // Set callback
      usb_msc.setReadWriteCallback(RP2040_msc_read_cb,
                                   RP2040_msc_write_cb,
                                   RP2040_msc_flush_cb);

      // Set disk size, block size should be 512 regardless of spi flash page size
      usb_msc.setCapacity(SPIFlash->size()/512, 512);

      // MSC is ready for read/write
      usb_msc.setUnitReady(true);

      usb_msc.begin();
#endif /* USE_TINYUSB */

      FATFS_is_mounted = fatfs.begin(SPIFlash);
      hw_info.storage  = FATFS_is_mounted ? STORAGE_FLASH : STORAGE_NONE;
    }
  }
#endif /* ARDUINO_ARCH_MBED */

  Wire1.setSCL(SOC_GPIO_PIN_SCL);
  Wire1.setSDA(SOC_GPIO_PIN_SDA);
  Wire1.begin();
  Wire1.beginTransmission(INA219_ADDRESS_ALT);
  RP2040_has_CPM = (Wire1.endTransmission() == 0);
  Wire1.end();

  if (RP2040_has_CPM) {
    ina219.begin(&Wire1);
//  ina219.setCalibration_16V_400mA();
  }

  USBSerial.begin(SERIAL_OUT_BR);

  for (int i=0; i < 20; i++) {if (USBSerial) break; else delay(100);}

#if defined(USE_USB_HOST)
  while (core1_booting) {}
#endif /* USE_USB_HOST */
}

static void RP2040_post_init()
{
  core0_booting = false;
}

static void RP2040_loop()
{
  if (wdt_is_active) {
#if !defined(ARDUINO_ARCH_MBED)
    Watchdog.reset();
#endif /* ARDUINO_ARCH_MBED */
  }
}

static void RP2040_fini()
{
  if (RP2040_has_CPM) {
//  ina219.powerSave(true);
  }

  if (RP2040_has_spiflash) {
#if defined(USE_TINYUSB)
    usb_msc.setUnitReady(false);
//  usb_msc.end(); /* N/A */
#endif /* USE_TINYUSB */
  }

#if !defined(ARDUINO_ARCH_MBED)
  if (SPIFlash != NULL) SPIFlash->end();
#endif /* ARDUINO_ARCH_MBED */

#if defined(USE_TINYUSB)
  // Disable USB
  USBDevice.detach();
#endif /* USE_TINYUSB */

  sleep_run_from_xosc();

#if SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN
  uint mode_button_pin = settings->rotate == ROTATE_180 ?
                         SOC_GPIO_PIN_KEY0 : SOC_GPIO_PIN_KEY2;
  #if SOC_GPIO_PIN_KEY2 == SOC_GPIO_PIN_BUTTON
    sleep_goto_dormant_until_pin(mode_button_pin, 0, HIGH);
  #else
    sleep_goto_dormant_until_pin(mode_button_pin, 0, LOW);
  #endif
#else
  datetime_t alarm = {0};
  sleep_goto_sleep_until(&alarm, NULL); /* TBD */
#endif /* SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN */

  // back from dormant state
  rosc_enable();
  clocks_init();

  rp2040.restart();
}

static void RP2040_reset()
{
  rp2040.restart();
}

static uint32_t RP2040_getChipId()
{
  return __builtin_bswap32(RP2040_chip_id[UniqueIDsize - 1]);
}

static uint32_t RP2040_getFreeHeap()
{
  return rp2040.getFreeHeap();
}

static bool RP2040_EEPROM_begin(size_t size)
{
  EEPROM.begin(size);

  if ( RP2040_has_spiflash && FATFS_is_mounted ) {
    File32 file = fatfs.open("/settings.json", FILE_READ);

    if (file) {
      // StaticJsonBuffer<RP2040_JSON_BUFFER_SIZE> RP2040_jsonBuffer;

      JsonObject &root = RP2040_jsonBuffer.parseObject(file);

      if (root.success()) {
        JsonVariant msg_class = root["class"];

        if (msg_class.success()) {
          const char *msg_class_s = msg_class.as<char*>();

          if (!strcmp(msg_class_s,"SKYVIEW")) {
            parseSettings(root);
          }
        }
      }
      file.close();
    }
  }

  if (RP2040_board != RP2040_RPIPICO_W &&
      (settings->connection == CON_BLUETOOTH_SPP ||
       settings->connection == CON_BLUETOOTH_LE)) {
    settings->connection = CON_USB; /* matches EEPROMHelper.cpp default value */
  }

  return true;
}

static void RP2040_WiFi_setOutputPower(int dB)
{
#if !defined(EXCLUDE_WIFI)
  WiFi.defaultLowPowerMode();
#endif /* EXCLUDE_WIFI */
}

static bool RP2040_WiFi_hostname(String aHostname)
{
  bool rval = false;
#if !defined(EXCLUDE_WIFI)
  if (RP2040_board != RP2040_WEACT && rp2040.isPicoW()) {
    WiFi.hostname(aHostname.c_str());
    rval = true;
  }
#endif /* EXCLUDE_WIFI */
  return rval;
}

static void RP2040_swSer_begin(unsigned long baud)
{
  SerialInput.begin(baud);
}

static void RP2040_swSer_enableRx(boolean arg)
{
  /* NONE */
}

static uint32_t RP2040_maxSketchSpace()
{
  return 1048576; /* TBD */
}

static void RP2040_WiFiUDP_stopAll()
{
#if !defined(EXCLUDE_WIFI)
  WiFiUDP::stopAll();
#endif /* EXCLUDE_WIFI */
}

static void RP2040_Battery_setup()
{
#if SOC_GPIO_PIN_BATTERY != SOC_UNUSED_PIN
  analogReadResolution(12);
  analogRead(SOC_GPIO_PIN_BATTERY);
#endif
}

#include "hardware/gpio.h"
#include "hardware/adc.h"

static float RP2040_Battery_voltage()
{
  uint16_t mV = 0;

  if (RP2040_has_CPM) {
    float shuntvoltage = ina219.getShuntVoltage_mV();
    float busvoltage   = ina219.getBusVoltage_V();

    return (busvoltage + (shuntvoltage / 1000));
  }

#if SOC_GPIO_PIN_BATTERY != SOC_UNUSED_PIN
  enum gpio_function pin25_func;
  enum gpio_function pin29_func;
  uint pin25_dir;
  uint pin29_dir;

  if (RP2040_board == RP2040_RPIPICO_W) {
    pin29_dir  = gpio_get_dir(SOC_GPIO_PIN_BATTERY);
    pin29_func = gpio_get_function(SOC_GPIO_PIN_BATTERY);
    adc_gpio_init(SOC_GPIO_PIN_BATTERY);

