lyusupov/SoftRF/software/firmware/source/SkyView/Platform_RP2040.cpp
    pin25_dir  = gpio_get_dir(SOC_GPIO_PIN_CYW43_EN);
    pin25_func = gpio_get_function(SOC_GPIO_PIN_CYW43_EN);
    pinMode(SOC_GPIO_PIN_CYW43_EN, OUTPUT);
    digitalWrite(SOC_GPIO_PIN_CYW43_EN, HIGH);
  }

  mV = (analogRead(SOC_GPIO_PIN_BATTERY) * 3300UL) >> 12;

  if (RP2040_board == RP2040_RPIPICO_W) {
    gpio_set_function(SOC_GPIO_PIN_CYW43_EN, pin25_func);
    gpio_set_dir(SOC_GPIO_PIN_CYW43_EN, pin25_dir);
    gpio_set_function(SOC_GPIO_PIN_BATTERY,  pin29_func);
    gpio_set_dir(SOC_GPIO_PIN_BATTERY,  pin29_dir);
  }
#endif
  return (mV * SOC_ADC_VOLTAGE_DIV / 1000.0);
}

#include <SoftSPI.h>
SoftSPI swSPI(SOC_EPD_PIN_MOSI_WS,
              SOC_EPD_PIN_MOSI_WS, /* half duplex */
              SOC_EPD_PIN_SCK_WS);

static ep_model_id RP2040_EPD_ident()
{
  ep_model_id rval = EP_GDEW027W3; /* default */

  digitalWrite(SOC_EPD_PIN_SS_WS, HIGH);
  pinMode(SOC_EPD_PIN_SS_WS, OUTPUT);
  digitalWrite(SOC_EPD_PIN_DC_WS, HIGH);
  pinMode(SOC_EPD_PIN_DC_WS, OUTPUT);

  digitalWrite(SOC_EPD_PIN_RST_WS, LOW);
  pinMode(SOC_EPD_PIN_RST_WS, OUTPUT);
  delay(20);
  pinMode(SOC_EPD_PIN_RST_WS, INPUT_PULLUP);
  delay(200);
  pinMode(SOC_EPD_PIN_BUSY_WS, INPUT);

  swSPI.begin();

  uint8_t buf_2D[11];
  uint8_t buf_2E[10];

  digitalWrite(SOC_EPD_PIN_DC_WS,  LOW);
  digitalWrite(SOC_EPD_PIN_SS_WS, LOW);

  swSPI.transfer_out(0x2D);

  pinMode(SOC_EPD_PIN_MOSI_WS, INPUT);
  digitalWrite(SOC_EPD_PIN_DC_WS, HIGH);

  for (int i=0; i<sizeof(buf_2D); i++) {
    buf_2D[i] = swSPI.transfer_in();
  }

  digitalWrite(SOC_EPD_PIN_SCK_WS, LOW);
  digitalWrite(SOC_EPD_PIN_DC_WS,  LOW);
  digitalWrite(SOC_EPD_PIN_SS_WS,  HIGH);

  delay(1);

  digitalWrite(SOC_EPD_PIN_DC_WS,  LOW);
  digitalWrite(SOC_EPD_PIN_SS_WS, LOW);

  swSPI.transfer_out(0x2E);

  pinMode(SOC_EPD_PIN_MOSI_WS, INPUT);
  digitalWrite(SOC_EPD_PIN_DC_WS, HIGH);

  for (int i=0; i<sizeof(buf_2E); i++) {
    buf_2E[i] = swSPI.transfer_in();
  }

  digitalWrite(SOC_EPD_PIN_SCK_WS, LOW);
  digitalWrite(SOC_EPD_PIN_DC_WS,  LOW);
  digitalWrite(SOC_EPD_PIN_SS_WS,  HIGH);

  swSPI.end();

#if 0
  Serial.print("2D: ");
  for (int i=0; i<sizeof(buf_2D); i++) {
    Serial.print(buf_2D[i], HEX);
    Serial.print(' ');
  }
  Serial.println();

  Serial.print("2E: ");
  for (int i=0; i<sizeof(buf_2E); i++) {
    Serial.print(buf_2E[i], HEX);
    Serial.print(' ');
  }
  Serial.println();

/*
 *  0x2D:
 *  FF FF FF FF FF FF FF FF FF FF FF - W3
 *  00 00 00 FF 00 00 40 01 00 00 00
 *
 *  0x2E:
 *  FF FF FF FF FF FF FF FF FF FF    - W3
 *  FF FF FF FF FF FF FF FF FF FF
 */
#endif

  bool is_ff = true;
  for (int i=0; i<sizeof(buf_2D); i++) {
    if (buf_2D[i] != 0xFF) {is_ff = false; break;}
  }

  bool is_00 = true;
  for (int i=0; i<sizeof(buf_2D); i++) {
    if (buf_2D[i] != 0x00) {is_00 = false; break;}
  }

  if (is_ff) {
    rval = EP_GDEW027W3;
  } else {
    rval = EP_GDEY027T91; /* TBD */
  }

  return rval;
}

static ep_model_id RP2040_display = EP_UNKNOWN;

static void RP2040_EPD_setup()
{
  switch(settings->adapter)
  {
  case ADAPTER_WAVESHARE_PICO_2_7_V2:
    display = &epd_waveshare_T91;

    SPI1.setRX(SOC_EPD_PIN_MISO_WS);
    SPI1.setTX(SOC_EPD_PIN_MOSI_WS);
    SPI1.setSCK(SOC_EPD_PIN_SCK_WS);
    SPI1.setCS(SOC_EPD_PIN_SS_WS);

    display->epd2.selectSPI(SPI1, SPISettings(4000000, MSBFIRST, SPI_MODE0));
    break;
  case ADAPTER_WAVESHARE_PICO_2_7:
  default:
    if (RP2040_display == EP_UNKNOWN) {
      RP2040_display = RP2040_EPD_ident();
    }

    switch (RP2040_display)
    {
    case EP_GDEY027T91:
      display = &epd_waveshare_T91;
      break;
    case EP_GDEW027W3:
    default:
      display = &epd_waveshare_W3;
      break;
    }

    SPI1.setRX(SOC_EPD_PIN_MISO_WS);
    SPI1.setTX(SOC_EPD_PIN_MOSI_WS);
    SPI1.setSCK(SOC_EPD_PIN_SCK_WS);
    SPI1.setCS(SOC_EPD_PIN_SS_WS);

    display->epd2.selectSPI(SPI1, SPISettings(4000000, MSBFIRST, SPI_MODE0));
    break;
  }
}

static void RP2040_EPD_fini()
{

}

static bool RP2040_EPD_is_ready()
{
  return true;
}

static void RP2040_EPD_Busy_Callback(const void* p)
{
  if (wdt_is_active) {
#if !defined(ARDUINO_ARCH_MBED)
    Watchdog.reset();
#endif /* ARDUINO_ARCH_MBED */
  }

  if (SoC->Bluetooth_ops) {
    SoC->Bluetooth_ops->loop();
  }

  if (SoC->USB_ops) {
    SoC->USB_ops->loop();
  }

  Input_loop();

  // Traffic_ClearExpired();

  // WiFi_loop();

  // Handle Web
  // Web_loop();

  // SoC->Button_loop();
  // button_up.check();
  // button_down.check();

  yield();
}

static void RP2040_EPD_update(int val)
{
  display->epd2.setBusyCallback(RP2040_EPD_Busy_Callback);
  EPD_Update_Sync(val);
  display->epd2.setBusyCallback(NULL);
}

static size_t RP2040_WiFi_Receive_UDP(uint8_t *buf, size_t max_size)
{
#if !defined(EXCLUDE_WIFI)
  return WiFi_Receive_UDP(buf, max_size);
#else
  return 0;
#endif /* EXCLUDE_WIFI */
}

static int RP2040_WiFi_clients_count()
{
#if !defined(EXCLUDE_WIFI)
  struct station_info *stat_info;
  int clients = 0;
  WiFiMode_t mode = WiFi.getMode();

  switch (mode)
  {
  case WIFI_AP:
    return WiFi.softAPgetStationNum();
  case WIFI_STA:
  default:
    return -1; /* error */
  }
#else
  return -1;
#endif /* EXCLUDE_WIFI */
}

static bool RP2040_DB_init()
{
  if (FATFS_is_mounted) {
    const char fileName[] = "/Aircrafts/ogn.cdb";

    if (ucdb.open(fileName) != CDB_OK) {
      Serial.print("Invalid CDB: ");
      Serial.println(fileName);
    } else {
      ADB_is_open = true;
    }
  }

  return ADB_is_open;
}

static bool RP2040_DB_query(uint8_t type, uint32_t id, char *buf, size_t size)
{
  bool rval = false;

  char key[8];
  char out[64];
  uint8_t tokens[3] = { 0 };
  cdbResult rt;
  int c, i = 0, token_cnt = 0;
  int tok_num = 1;

  if (!ADB_is_open) {
    return rval;
  }

  snprintf(key, sizeof(key),"%06X", id);

  rt = ucdb.findKey(key, strlen(key));

  switch (rt) {
    case KEY_FOUND:
      while ((c = ucdb.readValue()) != -1 && i < (sizeof(out) - 1)) {
        if (c == '|') {
          if (token_cnt < (sizeof(tokens) - 1)) {
            token_cnt++;
            tokens[token_cnt] = i+1;
          }
          c = 0;
        }
        out[i++] = (char) c;
      }
      out[i] = 0;

