lyusupov/SoftRF/software/firmware/source/SkyView/Platform_RP2040.cpp
      switch (settings->idpref)
      {
      case ID_TAIL:
        tok_num = 2;
        break;
      case ID_MAM:
        tok_num = 0;
        break;
      case ID_REG:
      default:
        tok_num = 1;
        break;
      }

      if (strlen(out + tokens[tok_num]) > 0) {
        snprintf(buf, size, "%s", out + tokens[tok_num]);
        rval = true;
      }
      break;

    case KEY_NOT_FOUND:
    default:
      break;
  }

  return rval;
}

static void RP2040_DB_fini()
{
  if (ADB_is_open) {
    ucdb.close();
    ADB_is_open = false;
  }
}

static void RP2040_TTS(char *message)
{
  if (!strcmp(message, "POST")) {
    if (hw_info.display == DISPLAY_EPD_2_7) {
      /* keep boot-time SkyView logo on the screen for 7 seconds */
      delay(7000);
    }
  }
}

#include <AceButton.h>
using namespace ace_button;

#if SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN
AceButton button_mode(SOC_GPIO_PIN_KEY2);
#endif /* SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN */
AceButton button_up  (SOC_GPIO_PIN_KEY1);
AceButton button_down(SOC_GPIO_PIN_KEY0);

// The event handler for the button.
void handleEvent(AceButton* button, uint8_t eventType,
    uint8_t buttonState) {

#if 0
  // Print out a message for all events.
#if SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN
  if (button == &button_mode) {
    Serial.print(F("MODE "));
  } else
#endif /* SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN */
  if (button == &button_up) {
    Serial.print(F("UP   "));
  } else if (button == &button_down) {
    Serial.print(F("DOWN "));
  }

  Serial.print(F("handleEvent(): eventType: "));
  Serial.print(eventType);
  Serial.print(F("; buttonState: "));
  Serial.println(buttonState);
#endif

  switch (eventType) {
    case AceButton::kEventPressed:
      break;
    case AceButton::kEventClicked:
    case AceButton::kEventReleased:
#if SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN
      if (button == &button_mode) {
        EPD_Mode();
      } else
#endif /* SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN */
      if (button == &button_up) {
        EPD_Up();
      } else if (button == &button_down) {
        EPD_Down();
      }
      break;
    case AceButton::kEventLongPressed:
#if SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN
      if (button == &button_mode) {

        if (digitalRead(SOC_GPIO_PIN_KEY1) == LOW) {
          screen_saver = true;
        }

        shutdown("NORMAL OFF");
//        Serial.println(F("This will never be printed."));
      }
#endif /* SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN */
      break;
  }
}

/* Callbacks for push button interrupt */
void onModeButtonEvent() {
#if SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN
  button_mode.check();
#endif /* SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN */
}

void onUpButtonEvent() {
  button_up.check();
}

void onDownButtonEvent() {
  button_down.check();
}

static void RP2040_Button_setup()
{
#if SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN
  int mode_button_pin = settings->rotate == ROTATE_180 ?
                        SOC_GPIO_PIN_KEY0 : SOC_GPIO_PIN_KEY2;

  pinMode(mode_button_pin,
          mode_button_pin == SOC_GPIO_PIN_BUTTON ? INPUT : INPUT_PULLUP);

  button_mode.init(mode_button_pin,
                   mode_button_pin == SOC_GPIO_PIN_BUTTON ? LOW : HIGH);

  // Configure the ButtonConfig with the event handler, and enable all higher
  // level events.
  ButtonConfig* ModeButtonConfig = button_mode.getButtonConfig();
  ModeButtonConfig->setEventHandler(handleEvent);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureClick);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureLongPress);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterClick);
//  ModeButtonConfig->setDebounceDelay(15);
  ModeButtonConfig->setClickDelay(100);
//  ModeButtonConfig->setDoubleClickDelay(1000);
  ModeButtonConfig->setLongPressDelay(2000);

//  attachInterrupt(digitalPinToInterrupt(mode_button_pin), onModeButtonEvent, CHANGE );
#endif /* SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN */

  pinMode(SOC_GPIO_PIN_KEY1, INPUT_PULLUP);

  int down_button_pin = settings->rotate == ROTATE_180 ?
                        SOC_GPIO_PIN_KEY2 : SOC_GPIO_PIN_KEY0;
  pinMode(down_button_pin, INPUT_PULLUP);
  button_down.init(down_button_pin, HIGH);

  ButtonConfig* UpButtonConfig = button_up.getButtonConfig();
  UpButtonConfig->setEventHandler(handleEvent);
  UpButtonConfig->setFeature(ButtonConfig::kFeatureClick);
  UpButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterClick);
//  UpButtonConfig->setDebounceDelay(15);
  UpButtonConfig->setClickDelay(100);
//  UpButtonConfig->setDoubleClickDelay(1000);
  UpButtonConfig->setLongPressDelay(2000);

  ButtonConfig* DownButtonConfig = button_down.getButtonConfig();
  DownButtonConfig->setEventHandler(handleEvent);
  DownButtonConfig->setFeature(ButtonConfig::kFeatureClick);
  DownButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterClick);
//  DownButtonConfig->setDebounceDelay(15);
  DownButtonConfig->setClickDelay(100);
//  DownButtonConfig->setDoubleClickDelay(1000);
  DownButtonConfig->setLongPressDelay(2000);

//  attachInterrupt(digitalPinToInterrupt(SOC_GPIO_PIN_KEY1), onUpButtonEvent,   CHANGE );
//  attachInterrupt(digitalPinToInterrupt(SOC_GPIO_PIN_KEY0), onDownButtonEvent, CHANGE );
}

#if defined(USE_BOOTSEL_BUTTON)
#define BOOTSEL_CLICK_DELAY                200
#define BOOTSEL_LONGPRESS_DELAY            2000

static unsigned long bootsel_time_marker = 0;
static bool prev_bootsel_state           = false;
static bool is_bootsel_click             = false;
#endif /* USE_BOOTSEL_BUTTON */

static void RP2040_Button_loop()
{
#if SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN
  button_mode.check();
#endif /* SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN */
  button_up.check();
  button_down.check();

#if defined(USE_BOOTSEL_BUTTON)
  if (BOOTSEL) {
    if (!prev_bootsel_state) {
      bootsel_time_marker = millis();
      prev_bootsel_state = true;
    } else {
      if (bootsel_time_marker && !is_bootsel_click &&
          millis() - bootsel_time_marker > BOOTSEL_CLICK_DELAY) {
        is_bootsel_click = true;
      }
      if (bootsel_time_marker &&
          millis() - bootsel_time_marker > BOOTSEL_LONGPRESS_DELAY) {
        shutdown("NORMAL OFF");
//      Serial.println(F("This will never be printed."));
      }
    }
  } else {
    if (prev_bootsel_state) {
      if (is_bootsel_click) {
        EPD_Mode();
        is_bootsel_click = false;
      }
      bootsel_time_marker = 0;
      prev_bootsel_state = false;
    }
  }
#endif /* USE_BOOTSEL_BUTTON */
}

static void RP2040_Button_fini()
{
//  detachInterrupt(digitalPinToInterrupt(SOC_GPIO_PIN_KEY0));
//  detachInterrupt(digitalPinToInterrupt(SOC_GPIO_PIN_KEY1));
//  detachInterrupt(digitalPinToInterrupt(SOC_GPIO_PIN_KEY2));

#if SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN
  int pin = settings->rotate == ROTATE_180 ? SOC_GPIO_PIN_KEY0 : SOC_GPIO_PIN_KEY2;
  while (digitalRead(pin) == (pin == SOC_GPIO_PIN_BUTTON ? HIGH : LOW));
#endif /* SOC_GPIO_PIN_KEY2 != SOC_UNUSED_PIN */

#if defined(USE_BOOTSEL_BUTTON)
  while (BOOTSEL);
#endif /* USE_BOOTSEL_BUTTON */
}

static void RP2040_WDT_setup()
{
#if !defined(ARDUINO_ARCH_MBED)
  Watchdog.enable(8000);
#endif /* ARDUINO_ARCH_MBED */
  wdt_is_active = true;
}

